@echo off 
:. 
echo    /======================\
echo   ‖      选项列表        ‖
echo    ========================
echo   ‖   1.直接关机         ‖
echo   ‖   2.30分钟后关机     ‖
echo   ‖   3.60分钟后关机     ‖
echo   ‖   4.90分钟后关机     ‖
echo   ‖   5.120分钟后关机    ‖
echo   ‖   6.180分钟后关机    ‖
echo   ‖   7.自定义关机时间   ‖ 
echo   ‖   8.取消关机         ‖ 
echo   ‖   0.退出             ‖ 
echo   ‖/====================\‖

:qu0
set /p qu=  ◇请输入你的选择(0~8)：
echo ========
if %qu% == 1 ( 
goto :qu1 
) else ( 
if %qu% == 2 ( 
goto :qu2 
) else ( 
if %qu% == 3 ( 
goto :qu3 
) else (
if %qu% == 4 ( 
goto :qu4 
) else ( 
if %qu% == 5 ( 
goto :qu5 
) else ( 
if %qu% == 6 ( 
goto :qu6 
) else ( 
if %qu% == 7 ( 
goto :qu7 
) else ( 
if %qu% == 8 ( 
goto :qu8 
) else (  
if %qu% == 0 ( 
goto :tuichu
) else (  
echo ~只能选择 0到8~
) 
) 
) 
)
)
)
)
)
)
goto :. 
:qu1 
echo ▲即将关机
::echo 确定关机（y/n）
set /p gj= 确定关机（y/n）?:
if %gj% == y ( 
goto :gj1 
) else ( 
if %qu% == n ( 
goto :gj2 
) else (  
echo ~只能选择y/n~
) 
)
goto :.
:gj1
shutdown -s
goto :.
:gj2
goto :qu0
 
goto :. 
:qu2 
shutdown -s -t 1800
echo  !!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!
echo  !!!!!计算机将在30分钟后关机!!!!!
echo  !!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!
echo *********************************************************
goto :. 
:qu3 
shutdown -s -t 3600
echo  !!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!
echo  !!!!!计算机将在60分钟后关机!!!!!
echo  !!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!
echo *********************************************************
goto :. 
:qu4 
shutdown -s -t 5400
echo  !!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!
echo  !!!!!计算机将在90分钟后关机!!!!!
echo  !!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!
echo **********************************************************
goto :. 
:qu5 
shutdown -s -t 7200
echo  !!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!
echo  !!!!!计算机将在120分钟后关机!!!!!
echo  !!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!
echo **********************************************************
goto :. 
:qu6 
shutdown -s -t 10800
echo  !!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!
echo  !!!!!计算机将在180分钟后关机!!!!!
echo  !!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!
echo ***********************************************************
goto :. 
:qu7 
set /p tm=   ◇请输入关机的时长（只能输入数值类型/分）：

if %tm% == 0 ( 
goto :0S
) else ( 
goto :S 
)
goto :.
:0S
set /p gj= 你确定输入0？，将直接关机（y/n）?:
if %gj% == y ( 
goto :gj1 
) else ( 
if %gj% == n ( 
goto :gj2 
) else (  
echo ~只能选择y/n~
) 
)
goto :.
:S
set /a tm1=%tm%*60
shutdown -s -t %tm1%
echo  !!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!
echo  !!!!!计算机将在%tm%分钟后关机!!!!!
echo  !!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!
echo ***********************************************************
goto :. 
:qu8 
shutdown -a
echo  !!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!
echo  !!!!!计算机定时关机已取消!!!!!
echo  !!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!
echo ***********************************************************
goto :qu0
goto :.
:tuichu
exit
goto :.

